In [1]:
import pandas as pd

In [2]:
data = pd.Series([.25, .50, .75, 1.0], index = ['a', 'b', 'c', 'd'])
data

a    0.25
b    0.50
c    0.75
d    1.00
dtype: float64

In [3]:
data['e'] = 1.25
data

a    0.25
b    0.50
c    0.75
d    1.00
e    1.25
dtype: float64

In [5]:
data['a':'c']

a    0.25
b    0.50
c    0.75
dtype: float64

In [6]:
data[0:2]

a    0.25
b    0.50
dtype: float64

In [10]:
#> .3 and < .8
data[(data > .3) & (data < .8)]

b    0.50
c    0.75
dtype: float64

In [12]:
#get vals - a and e 
data[['a','e']]

a    0.25
e    1.25
dtype: float64

In [13]:
area = pd.Series({'California':1,
                 'Texas':2,
                 'Florida': 3,
                 'NY': 4,
                 'Penn':5
                 })

pop = pd.Series({'California':10,
                 'Texas':20,
                 'Florida': 30,
                 'NY': 40,
                 'Penn':50
                 })

data = pd.DataFrame({'area':area ,
                    'pop':pop})
data

            area  pop
California     1   10
Texas          2   20
Florida        3   30
NY             4   40
Penn           5   50

In [14]:
data ['density'] = data['pop']/ data['area']
data

            area  pop  density
California     1   10     10.0
Texas          2   20     10.0
Florida        3   30     10.0
NY             4   40     10.0
Penn           5   50     10.0

In [15]:
data.values

array([[ 1., 10., 10.],
       [ 2., 20., 10.],
       [ 3., 30., 10.],
       [ 4., 40., 10.],
       [ 5., 50., 10.]])

In [16]:
#Transpose - rows and cols get swapped
data.T

         California  Texas  Florida    NY  Penn
area            1.0    2.0      3.0   4.0   5.0
pop            10.0   20.0     30.0  40.0  50.0
density        10.0   10.0     10.0  10.0  10.0

In [17]:
data.values[0]

array([ 1., 10., 10.])

In [18]:
data['area']

California    1
Texas         2
Florida       3
NY            4
Penn          5
Name: area, dtype: int64

In [22]:
#iloc - implicit index 
data.iloc[:3,:2]

            area  pop
California     1   10
Texas          2   20
Florida        3   30

In [25]:
#loc - explicit index 
data.loc[:'Florida', :'pop']

            area  pop
California     1   10
Texas          2   20
Florida        3   30

In [26]:
data

            area  pop  density
California     1   10     10.0
Texas          2   20     10.0
Florida        3   30     10.0
NY             4   40     10.0
Penn           5   50     10.0

In [34]:
#loc - explicit index 
data.loc[data['density'] > 3, ['pop', 'density']]

            pop  density
California   10     10.0
Texas        20     10.0
Florida      30     10.0
NY           40     10.0
Penn         50     10.0

In [35]:
#iloc - implicit index
data.iloc[0,2]

10.0

In [38]:
#loc - explicit index 
data.loc['California']['density']

10.0

In [39]:
data

            area  pop  density
California     1   10     10.0
Texas          2   20     10.0
Florida        3   30     10.0
NY             4   40     10.0
Penn           5   50     10.0

In [40]:
#refer rows via index 
data['Florida':'NY']

         area  pop  density
Florida     3   30     10.0
NY          4   40     10.0

In [41]:
#refer rows via number 
data[1:3]

         area  pop  density
Texas       2   20     10.0
Florida     3   30     10.0

In [43]:
#direct masking operations are interpreted row wise
data[data['density'] > 3]

            area  pop  density
California     1   10     10.0
Texas          2   20     10.0
Florida        3   30     10.0
NY             4   40     10.0
Penn           5   50     10.0